{
  "title": "Příručka a případová studie k budování technologických startupů",
  "author": "Jakub Dorian Charbulák",
  "type": "bakalářská práce",
  "year": "10467/121097",
  "handle": "10467/121097",
  "abstract": null,
  "abstract_en": "Příručka a případová studie k budování technologických startupůA Guide to Building a Technological Startup: A Case StudyTyp dokumentubakalářská prácebachelor thesisAutorJakub Dorian CharbulákVedoucí práceKordík PavelOponent prácePešek DavidStudijní oborManažerská informatika 2021Studijní programInformatikaInstituce přidělující hodnostkatedra softwarového inženýrství﻿﻿﻿PrávaA university thesis is a work protected by the Copyright Act. Extracts, copies and transcripts of the thesis are allowed for personal use only and at one?s own expense. The use of thesis should be in compliance with the Copyright Act http://www.mkcr.cz/assets/autorske-pravo/01-3982006.pdf and the citation ethics http://knihovny.cvut.cz/vychova/vskp.htmlVysokoškolská závěrečná práce je dílo chráněné autorským zákonem. Je možné pořizovat z něj na své náklady a pro svoji osobní potřebu výpisy, opisy a rozmnoženiny. Jeho využití musí být v souladu s autorským zákonem http://www.mkcr.cz/assets/autorske-pravo/01-3982006.pdf a citační etikou http://knihovny.cvut.cz/vychova/vskp.htmlMetadataZobrazit celý záznamAbstraktZakládání startupů je pro studenty technických oborů často náročné. Ačkoli jsou vzděláváni v oblasti vývoje softwaru, chybí jim praktické zkušenosti s navrhováním a uváděním produktu na trh. Typicky jsou vedeni k tomu, aby dokončili zadané téma, ale chybí jim praxe v iterativním přístupu, který zahrnuje pivotování a uvedení minimálně životaschopného produktu (MVP). Kromě toho se od nich očekává, že převezmou role jako vedoucí týmů, HR manažeři nebo produktoví manažeři, což vyžaduje zásadní změnu dovedností. Tato práce zkoumá, jak systematizovat rozvoj startupů v jejich raných fázích, zejména pro studenty zaměřené na technologie. Analyzovala stávající metodiky, jako jsou Lean Startup, Design Sprint, Agile a Lean Canvas, na základě kritérií, jako je jejich využitelnost v B2B sektoru, relevance pro technologické inovace a nedostatky v oblastech zakládání startupů. Dále byly provedeny rozhovory se zkušenými zakladateli startupů a odborníky z praxe, aby byly identifikovány mezery a doporučení ke zlepšení existujících metodologií. Na základě zjištěných poznatků byla navržena metodologie Lean and Execute, která je přizpůsobena potřebám studentů v evropském kontextu. Rámec klade důraz na pochopení potřeb uživatelů a klientů produktu a na postupné zlepšování, přičemž vede zakladatele k tomu, aby vyvíjeli MVP na základě ověřených potřeb, namísto investování do neověřených řešení. Poskytuje také strukturovaná doporučení týkající se tvorby týmu, strategií financování a vývoje produktu. Validace rámce byla provedena na autorově vlastním startupu formou případové studie. Analýza identifikovala přínosné prvky metodologie, omezení, která rámec nepokrývá, a také důsledky odchylek od metodologie. Tato případová studie ukázala, že rámec pomáhá snižovat nejistotu, zlepšovat rozhodovací procesy a slaďovat vývojové aktivity s požadavky trhu. Zjištění podtrhují význam propojení osvědčených metodologií, jako je Lean Startup a Lean Canvas, s poznatky zkušených odborníků při řešení specifických výzev, kterým studenti-zakladatelé čelí. Tato práce přispívá k oblasti zakládání startupů vytvořením praktického a přizpůsobeného průvodce ve formě aplikace Notion. Tento průvodce čerpá z poznatků z analyzovaných metodologií a rozhovorů a poskytuje vizuální plán zakládání startupu od počátku až po spuštění. V každé fázi zdůrazňuje klíčové znalosti, které si zakladatelé musí osvojit, a na základě toho stanovuje konkrétní úkoly pro realizaci v jejich startupu.Startup formation poses difficulties for technology-oriented student founders who are primarily trained in software development but often lack practical skills in refining a product. They are typically taught to select a topic and complete it, rather than engaging in the iterative process of product development that involves pivoting and launching small. Additionally, these founders must transition from being engineers to assuming roles such as HR managers, team leads, and product owners. This thesis investigated how to systemize early-stage startup development for student entrepreneurs. Existing frameworks, such as Lean Startup, Design Sprint, Agile, and Lean Canvas, were analyzed using criteria including their relevance for B2B contexts, their applicability to technological innovations, and the aspects of startup formation they do not address. Interviews with experienced startup founders and industry experts were also conducted to identify additional gaps and areas for improvement. Based on this analysis, the Lean and Execute startup formation framework was developed, specifically tailored to the needs of tech-oriented student founders operating in the European context. The framework emphasized a focused approach centered on understanding user and client needs, combined with iterative improvements, guiding founders to start with a minimal viable product (MVP) aligned with validated user requirements, rather than pursuing unvalidated solutions. The framework also provided structured recommendations on team formation, funding strategies, and product development. Validation was performed through its application to the authors own startup using a qualitative case study approach. The study evaluated effective aspects of the framework, identifying which elements were implemented successfully and why they were beneficial. It also examined limitations of the framework, noting what it failed to address and the resulting consequences, as well as the implications of deviations from the framework. This case study demonstrated the frameworks effectiveness in reducing uncertainty, streamlining decision-making processes, and aligning development efforts with market demands. The findings underscored the value of combining established methodologies, such as the Lean Startup approach and Lean Canvas, with insights from experienced professionals to address the specific challenges faced by student entrepreneurs. This thesis advanced the study of startup formation by offering a practical and tailored solution in the form of a Notion guide. The guide incorporates insights from the Background chapter, synthesizing the analyzed frameworks and interview findings. It provides a visual walkthrough of startup formation up to the launch phase, focusing in each stage on what the founder needs to learn. Based on this knowledge, it outlines specific tasks for execution within their startup.URIhttp://hdl.handle.net/10467/121097Zobrazit/otevřítPLNY_TEXT (2.513Mb)PRILOHA (304 bajtů)POSUDEK (43.37Kb)POSUDEK (48.29Kb)KolekceBakalářské práce - 18102[1745]",
  "keywords": [],
  "keywords_en": [],
  "department": "",
  "supervisor": "",
  "language": "",
  "url": "https://dspace.cvut.cz/handle/10467/121097",
  "pdf_url": "https://dspace.cvut.cz/bitstream/handle/10467/121097/F8-BP-2025-Charbulak-Jakub%20Dorian-FITthesis_LaTeX_master__1_.pdf?sequence=-1&isAllowed=y",
  "last_updated": "2025-03-29T21:38:47.518676"
}